const blogsData = [
  {
    userName: "白白的云朵真好看",
    time: "2018-12-11",
    content: "使用React构建的单页面应用，要想实现页面间的跳转，首先想到的就是使用路由。在React中，常用的有两个包可以实现这个需求，那就是react-router和react-router-dom。本文主要针对react-router-dom进行说明。",
    start: "14",
  },
  {
    userName: "花儿开得那么好",
    time: "2018-12-11",
    content: "我曾经好几个月直接睡实验室里，每天除了看论文，完成导师的任务，其他时间全部用来学习，晚上搞到十一二点，否则一年时间不可能学那么多东西，而且我大部分还写成了博客，要知道，写博客是很花时间的。如果你能像我这样坚持，这样严格要求自己，我不相信学不会一个东西。你就算今天学不会，你一个月之后呢？一个月不行，你一年总行了吧？就像马云爸爸说的：今天很残酷，明天更残酷，后天很美好。但是很多人都坚持不过明天，他永远看不到美好。就像我考研一样，没有坚持付出，哪来的结果？",
    start: "14",
  },
  {
    userName: "天上的星星有几颗",
    time: "2018-12-11",
    content: "使用React构建的单页面应用，要想实现页面间的跳转，首先想到的就是使用路由。在React中，常用的有两个包可以实现这个需求，那就是react-router和react-router-dom。本文主要针对react-router-dom进行说明。",
    start: "14",
  },
  {
    userName: "来自大山的娃",
    time: "2018-12-11",
    content: "后来我在实验室里闷头苦学了一年左右，从Java语法基础开始，到集合框架源码（那时候还是基于JDK1.7的）、到网络编程（基础）、到数据结构和算法，学完了这些基础知识后，开始学习Servlet/jsp（现在已经过时了）、再到Spring、Struts2、Hibernate（SSH框架，现在也过时了）、再到Spring、SpringMVC、Mybatis（SSM框架，这个现在还在用）、再到Java并发基础、再到一些组件等等，再到后面我开始学习微服务相关的东东，学习Spring Boot，Spring Cloud等等。这期间，我做了4个项目实战。我是如何自学的",
    start: "14",
  },
  {
    userName: "白白的云朵真好看",
    time: "2018-12-11",
    content: "人都有个尿性，如果你做一件事情，一直看不到明显的效果，你就会慢慢懈怠，慢慢怀疑自己到底对不对，适不适合。编程也一样，为什么我不建议初学者上来就抱着别人跟你推荐的所谓的经典书籍去啃？什么《Thinking in Java》、《Effective Java》等等，你啃的了吗？你啃不了是对的，否则你就是神了。你啃不了，你就会放弃。我就很讨厌那些贴吧论坛里一上来就给一些初学者推荐很多经典书籍的人，显得自己很博学很牛逼的样子，其实没啥卵用。",
    start: "14",
  }
];

export default blogsData;